[
  "Hey {name}, I didn't know the Zamboni was hiring—because you just got swept.",
  "You held the Cup about as long as a Krusty Burger stays fresh.",
  "{name}, your defense is more wide open than Moe's bar during prohibition.",
  "You lose the Cup faster than Homer loses jobs.",
  "The only ice you should be near is in a soda, champ.",
  "Nice try, {name}. If this were tee-ball, you'd still strike out.",
  "If excuses won championships, {name}, you'd be a dynasty.",
  "The Cup and I are in a committed relationship. You were just a rebound.",
  "That game was more one-sided than a Springfield election.",
  "You played like Milhouse in a slap fight.",
  "Hey {name}, the good news is your trophy case is still easy to dust.",
  "Looks like your goalie was just there for emotional support.",
  "I'd say 'good game,' but that would make me a liar and a bad person.",
  "Your game plan had more holes than a Squeaky-Voiced Teen's alibi.",
  "You didn't lose the Cup—you donated it.",
  "{name}, if you were any slower, the announcers would've cut to commercial.",
  "The only thing colder than your offense is your trophy cabinet.",
  "I haven't seen a meltdown that bad since Lard Lad's went up in flames.",
  "Hey {name}, you skate like Flanders prays—cautiously and with too much padding.",
  "Your season was brought to you by the letter L.",
  "That loss was more tragic than Lisa's sax solo getting cut for time.",
  "Maybe next year you'll ask for the Cup politely, {name}, because brute force clearly ain't it.",
  "You play hockey the way Grampa tells stories: slow, confusing, and no one's paying attention.",
  "I was worried for a second, then I remembered it was you.",
  "Your Cup run was shorter than Ralph Wiggum's attention span.",
  "You couldn't hold onto the Cup if it was stapled to your jersey.",
  "You're like Disco Stu—flashy entrance, no follow through.",
  "The Cup is allergic to losers. Hope you brought an EpiPen.",
  "Nice of you to show up, {name}. Next time, try playing.",
  "I haven't seen a collapse like that since Springfield Elementary's test scores.",
  "Congrats on peaking during the warm-up.",
  "You defended that Cup like Skinner defends his job: barely.",
  "Your team's effort was more invisible than Maggie.",
  "The Cup's got standards, {name}, and sadly... you don't meet 'em.",
  "You'd have a better shot winning if this were figure skating.",
  "Thanks for letting me borrow the Cup, {name}. You can visit it on weekends.",
  "That performance was a war crime in some provinces.",
  "I almost felt bad for you, {name}. Almost.",
  "Is your game sponsored by Duffman? Because it's always disappointing, {name}!",
  "{name}, the only thing you're clinching is your jaw watching me raise the Cup.",
  "Hey {name}, your strategy confused me—was it losing on purpose?",
  "I'd call that a game, but crimes against hockey are usually felonies.",
  "You're the kind of team the Cup blocks on social media.",
  "I thought you were tanking for draft picks—turns out you're just bad.",
  "That wasn't a loss, {name}—that was a full-blown embarrassment.",
  "My grandma skates better than you, {name}, and she's been dead since Season 9.",
  "Next time just mail me the Cup, {name}, save us both the shame.",
  "You dropped the Cup so hard I thought it owed you child support.",
  "That wasn't hockey—you just reenacted the Titanic.",
  "The Cup practically ran to me to get away from you.",
  "If you were any more invisible on the ice, you'd be Milhouse at a party.",
  "You're not even a rival, {name}—you're background noise.",
  "Hope you took pictures holding the Cup, {name}, 'cause it's back where it belongs now.",
  "If choking was a sport, {name}, you'd finally be in the playoffs.",
  "Your team was like Krusty's comeback special—overhyped and unwatchable.",
  "You're like the Isotopes—except less threatening.",
  "That performance should be studied by scientists. As a warning.",
  "Thanks for the warm-up game, {name}. I barely broke a sweat.",
  "I haven't seen a beating that bad since Homer boxed Dredrick Tatum.",
  "You looked like you were playing blindfolded and drunk, {name}. Was that... intentional?",
  "The Cup doesn't do charity work, {name}. Try a soup kitchen.",
  "I heard you brought your A-game, {name}. A for absolute trash.",
  "Your goalie flinched so much I thought he was dodging child support.",
  "Hey {name}, was that a game plan or a cry for help?",
  "The Cup's allergic to desperation—don't get too close.",
  "You defended that Cup like Ralph defends his lunch money.",
  "It's cute that you tried, {name}. Sad. But cute.",
  "Your fans left early, {name}. So did your dignity.",
  "You're not cursed—you're just consistently terrible.",
  "The only thing you're elite at is exiting the playoffs.",
  "If losing built character, {name}, you'd be a Nobel Prize winner by now.",
  "I saw more hits in a Lisa sax solo than your entire game.",
  "If it helps, {name}, you made a wonderful cautionary tale.",
  "I didn't win, {name}. You gifted me the Cup with a bow on top.",
  "You couldn't score in an empty net with a GPS and divine intervention.",
  "The only ice you should touch is in a cocktail. From the stands.",
  "If self-sabotage was a skill, {name}, you'd be captain for life.",
  "That wasn't a game, {name}—that was an extended apology."
]
